# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.19-s055_1 on Fri Nov 28 22:15:35 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design onset_detector

create_clock -name "clk" -period 61.03516 -waveform {0.0 30.517578} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r4[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r5[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {channel_r6[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.1 [get_ports {onset_detected[0]}]
